app/Controllers/CasasController.php

SELECT *
FROM `casas`
---
    public function index()
    {
        $model = new CasaModel();
        $data['casas'] = $model->findAll();

INSERT INTO `ciudades` (`nombre_ciudad`) VALUES ('rio tercero')
---
    public function store()
    {
        $model = new CasaModel();
        $direccionModel = new DireccionModel();
        $ciudadModel = new CiudadModel();

        // Obtener los datos del formulario
        $nombre_casa = $this->request->getPost('nombre');
        $direccion = $this->request->getPost('direccion');
        $ciudad = $this->request->getPost('ciudad');

        // Insertar la ciudad en la tabla ciudades si no existe
        $ciudadExistente = $ciudadModel->where('nombre_ciudad', $ciudad)->first();
        if (!$ciudadExistente) {
            $data_ciudad = [
                'nombre_ciudad' => $ciudad
            ];
            $ciudadModel->insert($data_ciudad);

INSERT INTO `casas` (`nombre_casa`, `id_direccion`, `id_ciudad`) VALUES ('lautaro', 1, 1)
---
        ];

        // Guardar los datos en la base de datos
        if ($model->save($data_casa)) {