app/Controllers/PanelController.php

SELECT *
FROM `consumo`
WHERE `id_usuario` = '0'
SELECT *
FROM `dispositivo`
---
    public function index()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login');
        }

        $consumoModel = new ConsumoModel();
        $dispositivoModel = new DispositivoModel();
        $id_usuario = $session->get('id_usuario');

        $data['consumos'] = $consumoModel->where('id_usuario', $id_usuario)->findAll();
        $data['dispositivos'] = $dispositivoModel->findAll();